export const studentTable = [
    {
        value: 'الصورة الشخصية'
    },
    { 
        value: 'الاسم الاول', 
    },
    {
        value: 'الاسم الاخير',
    },
    {
        value: 'الاسم بالكامل',
    },
    {
        value: 'الصف الدراسي',
    },
    {
        value: 'الشعبة العلمي',
    },
    {
        value: 'المجموعة',
    },
    {
        value: 'رقم الهاتف',
    },
    {
        value: 'البريد الالكتروني',
    },
    {
        value: 'أسم المستخدم',
    },
    {
        value: 'معرف الطالب',
    },
];